Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetFilteredObjectsWithType Method
 Returns an enumerator of the model objects in the current model with the given type and selected by the filter.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetFilteredObjectsWithType(
	ModelObject.ModelObjectEnum Enum,
	string FilterName
)
Public Function GetFilteredObjectsWithType (
	Enum As ModelObject.ModelObjectEnum,
	FilterName As String
) As ModelObjectEnumerator
Parameters
Enum
Type: Tekla.Structures.Model.ModelObject.ModelObjectEnum
The type of the objects to return.
FilterName
Type: System.String
The name of an existing selection filter to apply.
Return Value
Type: ModelObjectEnumerator
A model object enumerator of the model objects with the given type and selected by the filter.
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model Namespace